Revit 2024 API
Rebar.GetAllRebarShapeIds Method
 Gets the ids of the RebarShapes elements that defines the shapes of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public IList<ElementId> GetAllRebarShapeIds()
Visual Basic
Public Function GetAllRebarShapeIds As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetAllRebarShapeIds()
Return Value
 Returns the ids of the RebarShapes elements that defines the shapes of the rebar.
Remarks
 If multiple bars in the set has the same shape id, this id will be reported only one in the resulted array.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace